app/controllers/albums_controller.rb

SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", "T2ZmIHRoZSBXYWxsOlNtOX"], ["LIMIT", 1]]
---
    def create
      if @artist
        if album_params[:name] && album_params[:genre]
          if Album.exists?(id: Base64.strict_encode64("#{album_params[:name]}:#{@artist.id}")[0,22])
            @album = Album.find_by(id: Base64.strict_encode64("#{album_params[:name]}:#{@artist.id}")[0,22])