app/controllers/albums_controller.rb

    def index
      if @artist
        @albums = @artist.albums
      else
        @albums = Album.all
      end
      my_response = []
      @albums.each do |album|
        my_response << {id: album.id,
                        name: album.name,
                        genre: album.genre,
                        artist: "https://iic3103-music.herokuapp.com/artists/#{album.artist.id}",
                        tracks: "https://iic3103-music.herokuapp.com/albums/#{album.id}/tracks",
                        self: "https://iic3103-music.herokuapp.com/albums/#{album.id}",
        }
---
SELECT "albums".* FROM "albums" WHERE "albums"."artist_id" = ?  [["artist_id", nil]]
SELECT "albums".* FROM "albums" WHERE "albums"."artist_id" = ?  [["artist_id", "Sm9yZ2UgR29uesOhbGV6"]]
INSERT INTO "albums" ("id", "artist_id", "name", "genre", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["id", "T2ZmIHRoZSBXYWxsOlNtOX"], ["artist_id", 0], ["name", "Off the Wall"], ["genre", "Pop"], ["created_at", "2021-05-03 05:28:32.528073"], ["updated_at", "2021-05-03 05:28:32.528073"]]

    def create
      if @artist && !@album && !@track
        @album = @artist.albums.create!(album_params.merge(:id => Base64.strict_encode64("#{album_params[:name]}:#{@artist.id}")[0,22]))
        @album.artist_id = @album.artist.id
        if @album.save
---
INSERT INTO "albums" ("id", "artist_id", "name", "genre", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["id", "T2ZmIHRoZSBXYWxsOlNtOX"], ["artist_id", 0], ["name", "Off the Wall"], ["genre", "Pop"], ["created_at", "2021-05-03 05:28:32.528073"], ["updated_at", "2021-05-03 05:28:32.528073"]]
UPDATE "albums" SET "artist_id" = ?, "updated_at" = ? WHERE "albums"."id" = ?  [["artist_id", 0], ["updated_at", "2021-05-03 05:47:22.126022"], ["id", "T2ZmIHRoZSBXYWxsOlNtOX"]]

    def get_artist
      @artist = Artist.find(params[:artist_id]) if params[:artist_id]
---
SELECT "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", "Sm9yZ2UgR29uesOhbGV6"], ["LIMIT", 1]]

    def get_album
      @album = Album.find(params[:id]) if params[:id]
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", "T2ZmIHRoZSBXYWxsOlNtOX"], ["LIMIT", 1]]