app/controllers/artists_controller.rb

SELECT "artists".* FROM "artists"
INSERT INTO "artists" ("id", "name", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["id", "Sm9yZ2UgR29uesOhbGV6"], ["name", "Jorge González"], ["age", 55], ["created_at", "2021-05-03 04:49:30.825542"], ["updated_at", "2021-05-03 04:49:30.825542"]]
---
  def index
    @artists = Artist.all
    my_response = []
    @artists.each do |artist|
      my_response << {id: artist.id,
                      name: artist.name,
                      age: artist.age,
                      albums: "https://iic3103-music.herokuapp.com/artists/#{artist.id}/albums",
                      tracks: "https://iic3103-music.herokuapp.com/artists/#{artist.id}/tracks",
                      self: "https://iic3103-music.herokuapp.com/artists/#{artist.id}"

INSERT INTO "artists" ("id", "name", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["id", "Sm9yZ2UgR29uesOhbGV6"], ["name", "Jorge González"], ["age", 55], ["created_at", "2021-05-03 04:49:30.825542"], ["updated_at", "2021-05-03 04:49:30.825542"]]
---
  def create
    if artist_params[:name] && artist_params[:age]
      if Artist.exists?(name: artist_params[:name])
        @artist = Artist.find_by(name: artist_params[:name])
        render :json => {
            id: @artist.id,
            name: @artist.name,
            age: @artist.age,
            albums: "https://iic3103-music.herokuapp.com/artists/#{@artist.id}/albums",
            tracks: "https://iic3103-music.herokuapp.com/artists/#{@artist.id}/tracks",
            self: "https://iic3103-music.herokuapp.com/artists/#{@artist.id}",
          }, :status => 409
      else
        @artist = Artist.new(artist_params)
        @artist.id = Base64.strict_encode64(artist_params[:name])[0,22]
        if @artist.save