app/controllers/tracks_controller.rb

    def index
      if @artist && !@album
        @tracks = @artist.tracks
        my_response = []
        @tracks.each do |track|
          my_response << {id: track.id,
                          name: track.name,
                          duration: track.duration,
                          artist: "http://127.0.0.1:3000/artists/#{track.album.artist.id}",
                          album: "http://127.0.0.1:3000/albums/#{track.album.id}",
                          self: "http://127.0.0.1:3000/tracks/#{track.id}",
          }
        end

        render json: my_response.to_json, :status => 200
      elsif !@artist && @album
        @tracks = @album.tracks
        my_response = []
        @tracks.each do |track|
          my_response << {id: track.id,
                          name: track.name,
                          duration: track.duration,
                          artist: "http://127.0.0.1:3000/artists/#{track.album.artist.id}",
                          album: "http://127.0.0.1:3000/albums/#{track.album.id}",
                          self: "http://127.0.0.1:3000/tracks/#{track.id}",
          }
---
SELECT "tracks".* FROM "tracks" INNER JOIN "albums" ON "tracks"."album_id" = "albums"."id" WHERE "albums"."artist_id" = ?  [["artist_id", "Sm9yZ2UgR29uesOhbGV6"]]
SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = ?  [["album_id", "T2ZmIHRoZSBXYWxsOlNtOX"]]
INSERT INTO "tracks" ("id", "album_id", "name", "duration", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

      elsif !@artist && !@album
        @tracks = Track.all
        my_response = []
        @tracks.each do |track|
---
SELECT "tracks".* FROM "tracks"

    def create
      if !@artist && @album && !@track
        @track = @album.tracks.create!(track_params.merge(:id => Base64.strict_encode64("#{track_params[:name]}:#{@album.id}")[0,22]))
---
INSERT INTO "tracks" ("id", "album_id", "name", "duration", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def get_artist
      @artist = Artist.find(params[:artist_id]) if params[:artist_id]
---
SELECT "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", "Sm9yZ2UgR29uesOhbGV6"], ["LIMIT", 1]]

    def get_album
      @album = Album.find(params[:album_id]) if params[:album_id]
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", "T2ZmIHRoZSBXYWxsOlNtOX"], ["LIMIT", 1]]

    def get_track
      @track = Track.find(params[:id]) if params[:id]
---
SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = ? LIMIT ?  [["id", "RG9uJ3QgU3RvcCAnVGlsIF"], ["LIMIT", 1]]